---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueElevation
source: html/fa4c4932-b183-8422-9b13-1c91714b1d93.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartValueElevation Property

"Start Attachment Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartValueElevation { get; }
```